[{"Belk College of Business": {"Business Info Systems/Operations": {"Alan Turovlin": {"link": "https://pages.charlotte.edu/connections/people/aturovli/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Anthony Stylianou": {"link": "https://pages.charlotte.edu/connections/people/astylian/", "bio": " Professional Activities  CV Research Portfolio  ", "academic_interests": ["E-business", "e-commerce", "information systems management", "quality improvement"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Artemis Vouzouni": {"link": "https://pages.charlotte.edu/connections/people/avouzoun/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Benyawarath Nithithanatchinnapat": {"link": "https://pages.charlotte.edu/connections/people/bnithith/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Brittani Washington": {"link": "https://pages.charlotte.edu/connections/people/bwashi17/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Cem Saydam": {"link": "https://pages.charlotte.edu/connections/people/saydam/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Chandrasekar Subramaniam": {"link": "https://pages.charlotte.edu/connections/people/csubrama/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Dongsong Zhang": {"link": "https://pages.charlotte.edu/connections/people/dzhang15/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Jing Zhou": {"link": "https://pages.charlotte.edu/connections/people/jzhou7/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Kexin Zhao": {"link": "https://pages.charlotte.edu/connections/people/kzhao2/", "bio": " Professor Zhao’s current research focuses on electronic commerce, virtual communities, and e-business standardization. Her papers have been accepted in several leading academic journals, including Information Systems Research,Journal of the Association for Information Systems,Journal of Management Information Systems, Journal of Retailing, Decision Sciences,Decision Support Systems,andmany others. Dr. Zhao is an associate editor of Decision Support Systems. She is a member of AIS and INFORMS. Professor Zhao’s teaching interests include business analytics, management information systems, and enterprise systems. She has taught courses in both the undergraduate and the graduate programs at the Belk College of Business.  ", "academic_interests": ["e-business standards", "e-business standards adoption", "e-business standards development", "game theory in information management", "information systems economics"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Lina Zhou": {"link": "https://pages.charlotte.edu/connections/people/lzhou8/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Ming-Chang Huang": {"link": "https://pages.charlotte.edu/connections/people/ming-chang-huang/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Monica Johar": {"link": "https://pages.charlotte.edu/connections/people/msjohar/", "bio": "vita ", "academic_interests": ["content delivery systems", "optimal software development methodologies", "web personalization"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Moutaz Khouja": {"link": "https://pages.charlotte.edu/connections/people/mjkhouja/", "bio": " Moutaz Khouja is a Professor of Operations Management at the University of North Carolina at Charlotte. He holds a Ph.D. in Operations Management from Kent State University. His areas of interest include technology evaluation and selection, inventory management, quality management, and service operations. His publications have appeared in Decision Sciences, IIE Transactions, European Journal of Operational Research, Journal of the Operation Research Society, and Interfaces, among others.   Resume ", "academic_interests": ["manufacturing", "planning and control", "quality control", "quality management", "service management", "service operations", "statistics", "supply chain management"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Ram Kumar": {"link": "https://pages.charlotte.edu/connections/people/rlkumar/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Reginald Silver": {"link": "https://pages.charlotte.edu/connections/people/rsilver5/", "bio": "", "academic_interests": ["analytics", "data science", "public health"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "SungJune Park": {"link": "https://pages.charlotte.edu/connections/people/sungjune-park/", "bio": "   ", "academic_interests": ["business analytics", "E-business", "information security", "supply chain management"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Vinay Vasudev": {"link": "https://pages.charlotte.edu/connections/people/vkvasude/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Xiuli He": {"link": "https://pages.charlotte.edu/connections/people/xhe8/", "bio": " Prof. Xiuli He joined the Belk College of Business at the University of North Carolina at Charlotte in 2008. She received her PhD in Supply Chain and Operations Management from the McCombs School of Business at the University of Texas at Austin. Prof. He’s research is at the interface between supply chain management and other areas such as marketing, finance and economics. Her recent research papers have been published in Production and Operations Management, Decision Sciences Journal, Omega, European Journal of Operational Research, International Journal of Production Economics, International Journal of Production Research, Journal of Operational Research Society, Operations Research Letters, and other journals. She served as the Senior Guest Editor of the POM Journal in 2015. She is an associate editor of Omega (since 2015) and is a former associate editor of International Journal of Production Research (2011-2015). She serves as the Vice President for Colleges and is on the Editorial Board of Production and Operations Management Society.She is the recipient of the Belk College’s Outstanding Service Award in May 2019 and POM Society’s Outstanding Service Award in 2018, 2019, and 2021. Prior to joining UNC Charlotte, she was a visiting Assistant Professor of Operations Management in the School of Management at the University of Texas at Dallas. She also worked as an equity analyst in Shanghai (China) before her doctoral study. ", "academic_interests": ["OM-marketing interface", "operations management", "supply chain coordination", "supply chain management"], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Xue Guo": {"link": "https://pages.charlotte.edu/connections/people/xguo9/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}}, "Economics": {"Arthur Zillante": {"link": "https://pages.charlotte.edu/connections/people/azillant/", "bio": "Phone: (704) 687-7589   Fax: (704) 687-1380 Mailing address: Dept. of Economics UNC Charlotte 9201 University City Blvd. Charlotte, NC 28223 Email: azillant@uncc.edu Curriculum Vitae ", "academic_interests": ["income inequality", "International economics", "Macroeconomics", "poverty", "public policy", "social issues", "Social policy"], "college": "Belk College of Business", "department": "Economics"}, "Carol Stivender": {"link": "https://pages.charlotte.edu/connections/people/costiven/", "bio": "     CURRENT STUDENTS USE MOODLE    Spring2015      Class Schedule Monday ECON 2101 – Principles of Macroeconomics    3:30pm to 4:45pm –ROWE 130    5:00pm to 6:15pm –ROWE 130  Office Hours  Monday  1:00pm to 3:00pm Wednesday  10:00am to 12:00pm  (and by appointment as needed. Also, drop by – If I’m in and can see you, I will)          ", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Craig Depken II": {"link": "https://pages.charlotte.edu/connections/people/cdepken/", "bio": "Current teaching Fall: ECON6113 Cross-section and Time Series Econometrics ECON3181 Economics of Sports Spring ECON6217 Advanced Microeconometrics  Recent Research Journal of Sports Economics (multiple) Journal of Real Estate Finance and Economics Journal of Financial Markets Journal of Real Estate Research International Journal of Sport Finance Land Economics  Tidbits of potential interest: I was quoted in this story on Daily Fantasy Sports (Oct 2015) I presented Measuring the Impact of Cultural and Sporting Events: Evidence from Charlotte, North Carolina” at the European Sports Economics Association annual meeting in Zurich, Switzerland (Sept 2015) I taught Panel Data Econometrics at the University of Zagreb (June 2015) I gave a guest lecture at Clemson University on the impact of winning on stock prices in the English Premier League (April 2015) I was elected to a two-year term as an at-large member of the Executive Committee for the North American Association of Sports Economists (May 2014) I was quoted in this article concerning the 2014 NCAA Basketball Tournament (April 2014) My paper with Pete Groothuis and Kurt Rotthoff Influences on Sponsorship Deals in NASCAR: Indirect Evidence from Time on Camera” was accepted at Applied Economics (February 2014) I gave a guest lecture at Wake Forest University on rent seeking and professional sports stadiums (February 2014) I was misnamed in this interview concerning the August 2014 soccer match to be hosted in Charlotte (February 2014). My paper with Steve Swidler and Harris Hollans A Low Cost Methodology for Correcting the Distressed Sales Bias in a Downward Spiraling Housing Market” was accepted for publication in the Journal of Real Estate Research (December 2013) I gave presentations on the NHL Lockout of 2005 and the NFL Referee Lockout of 2012 at Ohio State University (October 2013). I taught panel data econometrics at the University of Zagreb in June 2013 My paper Performance Under Pressure: Preliminary Evidence from the National Hockey League,” with Dennis Wilson and Robert Sonora was published in the International Journal of Sport Finance (August 2012). My paper with Steve Swidler and Harris Hollans Flips, Flops and Foreclosures: Anatomy of a Housing Bubble” was awarded the paper of the year in Innovative Thinking” by the American Real Estate Society (August 2011) I was named a co-editor of Contemporary Economic Policy (July 2011) I was promoted to full professor (July 2011) A new working paper with Peter Groothius and Kurt Rotthoff Influences on Sponsorship Deals in NASCAR: Indirect Evidence from Time on Camera” (July 2011) I was named to the editorial board of the Journal of Sports Economics (May 2011) I presented Player Managers in Professional Baseball and Performance Under Pressure in NHL Shootouts at the European Sports Economics Association in Prague (May 2011) I gave apresentation concerning Player Managers in Professional Baseball at Clemson (April 2011) I gave apresentation concerning Performance under Pressure in NHL Shootouts at Clemson (April 2011) I was cited in this American Public Radio story concerning the NFL lockout (April 2011) I gave apresentation to the local ODE chapter concerning my sports economics research (March 2011) I was cited in this WCCB Fox story concerning NASCAR sponsorships (March 2011) My paper with J. Berkowitz and D. Wilson on uncertainty of outcome in NASCAR was accepted for publiation in th Journal of Sports Economics (March 2011) I was cited in this Detroit News article concerning the Detroit Pistons. (March 2011) I was cited in this Charlotte Observer article concerning economic impact studes (February 2011) I was mentioned in this That’s Racin article about NASCAR (Feb. 2011) I was quoted in this story concerning the economic impact of the Super Bowl (Feb. 2011) I was cited in this Asahi Shimbun article about sports prices (Jan. 2011) I was cited in this Gaston Gazette article about NASCAR sponsorships (Jan 2011) I was cited in this Providence Journal article about ticket scalping (January 2011) My paper with D. Wilson and UNCC Math Finance Student C. Williams From the Hardwood to the Gridiron to the Dorm: Influences on Women’s Collegiate Basketball Attendance” was accepted for publication in theInternational Journal of Sport Finance (Dec. 2010) I was cited in this Sun News (SC) article concerning the impact of bowl games on universities (Dec. 2010). I was cited in this Cleveland County (NC) Star article concerning the rising price of gasoline (Dec. 2010). My paper Flips, Flops and Foreclosures: Anatomy of a Housing Bubble,” with H. Hollans and S. Swidler was accepted for publication in Journal of Financial Economics Policy (Nov. 2010) I was cited in this Fort Worth Star-Telegram article about stadiums and mass transit systems (Oct. 2010) My paper Mega-Events: Is Baylor Football to Waco what the Super Bowl is to Houston?” with D. Coates was accepted for publication in Journal of Sports Economics (Oct. 2010) My paper Do Tax Benefits Conferred to Sub-S Banks Affect Their Deposit or Loan Rates?” with H. Hollans and S. Swidler was accepted for publication in Finance Research Letters (Sept. 2010) I was quoted in this Seattle Weekly article about the leaked MLB financial documents (August 2010)  Esse Quam Videri There may be macroeconomic problems, there are only microeconomic explanations and solutions” – Roger Garrison ", "academic_interests": ["applied public choice", "economics of advertising", "ecosystem services", "local economic development", "public policy", "regional economic development"], "college": "Belk College of Business", "department": "Economics"}, "Hui-Kuan Tseng": {"link": "https://pages.charlotte.edu/connections/people/htseng/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Hwan-Chyang Lin": {"link": "https://pages.charlotte.edu/connections/people/hwlin/", "bio": " My research interests are in the areas of economic growth, international trade, and computational economics and finance, with a focus on technological innovation, endogenous growth, and economic well-being.  My latest research involves numerical methods for solving economic dynamics and functional differential equations, and is aimed at designing innovation-reward systems that beat patents. I am experienced in solving dynamical systems numerically. I enjoy programming in Python, C/C++, and Fortran.   ", "academic_interests": ["computational economics", "computational finance", "economic growth", "International economics", "international trade"], "college": "Belk College of Business", "department": "Economics"}, "John Connaughton": {"link": "https://pages.charlotte.edu/connections/people/jec/", "bio": " John Connaughton joined the UNC Charlotte faculty in 1978. He is the director of the UNC Charlotte Economic Forecast, which is recognized as the leading source of economic information for North Carolina. Dr. Connaughton has authored economic impact studies that have received widespread attention. His work is frequently quoted in both local and national publications, and his study on the Superconducting Super Collider is cataloged in the United States Library of Congress.  Education: Ph.D. Northeastern University M.A. Northeastern University B.A. Boston State College Areas of Expertise: UNC-Charlotte Economic Forecast Economic Impact Studies Regional Economics Sports Economics ", "academic_interests": ["Economic impact analysis", "Regional economics", "Sports economics"], "college": "Belk College of Business", "department": "Economics"}, "Kelly Vosters": {"link": "https://pages.charlotte.edu/connections/people/kvosters/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Krista Saral": {"link": "https://pages.charlotte.edu/connections/people/ksaral/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Lisa Schulkind": {"link": "https://pages.charlotte.edu/connections/people/lschulki/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Louis Amato": {"link": "https://pages.charlotte.edu/connections/people/ltamato/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Matthew Metzgar": {"link": "https://pages.charlotte.edu/connections/people/mmetzgar/", "bio": "Matthew Metzgar, Ph.D. Clinical Assistant Professor of Economics  Recent Publications Metzgar M. 2012. Sustainability of natural movement activity.” Sustainability: Science, Practice, & Policy 8(2): 54-60. Metzgar M. 2012. Externalities from Grain Consumption: A Survey.” International Journal of Food Sciences and Nutrition. 63(4): 453-60. Metzgar M. 2011. Evolutionary Theory and Student Motivation.” Psychology and Education: An Interdisciplinary Journal. 48(3-4): 22-28. Metzgar M, Rideout TC, Fontes-Villalba M, Kuipers RS. 2011. Feasibility of a Paleolithic Diet for Low-Income Consumers.” Nutrition Research. 31(6): 444-51.  Teaching Fall 2011 – Principles of Macroeconomics Spring 2012 – Principles of Macroeconomics, Intermediate Macroeconomics Summer 2012 – Managerial Economics Fall 2012 to present– Managerial Economics ", "academic_interests": ["analysis of healthy diets", "economics of obesity", "health", "public finance", "sustainability of food production"], "college": "Belk College of Business", "department": "Economics"}, "Musab Kurnaz": {"link": "https://pages.charlotte.edu/connections/people/mkurnaz/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}, "Paul Gaggl": {"link": "https://pages.charlotte.edu/connections/people/pgaggl/", "bio": "var sc_project=7388323; var sc_invisible=0; var sc_security=”369a32c6″;  http://www.statcounter.com/counter/counter.js    Paul Gaggl, PhD (UC Davis) Associate Professor of Economics Director, Master of Science in Economics Public Policy Faculty Affiliate University of North Carolina at Charlotte Belk College of Business Department of Economics 9201 University City Blvd Charlotte, NC 28223-0001 USA  Quick Links Research Curriculum Vitae [pdf] UNC Charlotte Economics Seminar UNC Charlotte Working Paper Series I-85 Macro Workshop  ", "academic_interests": ["communication technology", "income distribution", "labor economics", "labor markets", "labor welfare", "Macroeconomics", "technology adoption"], "college": "Belk College of Business", "department": "Economics"}, "Per Norander": {"link": "https://pages.charlotte.edu/connections/people/pnorande/", "bio": "", "academic_interests": [], "college": "Belk College of Business", "department": "Economics"}}, "Finance": {}, "Management": {}, "Marketing": {}, "Turner School of Accountancy": {}}, "College of Arts + Architecture": {"Art & Art History": {}, "Dance": {}, "Music": {}, "Performing Arts Services": {}, "School of Architecture": {}, "Theatre": {}}, "College of Computing & Informatics": {"Bioinformatics and Genomics": {}, "Bioinformatics Research Center": {}, "Computer Science": {}, "Software & Information Systems": {}, "School of Data Science (SDS)": {}}, "College of Education": {"Counseling": {}, "Ctr For STEM Education": {}, "Educational Leadership": {}, "Middle Grades Secondary & K-12": {}, "Reading & Elementary ED": {}, "School & Community Partnerships": {}, "Special Ed & Child Dev": {}}, "College of Health & Human Services": {"Kinesiology": {}, "Public Health Sciences": {}, "School of Nursing": {}, "School of Social Work": {}}, "College of Liberal Arts & Sciences": {"Africana Studies": {}, "Anthropology": {}, "Biological Sciences": {}, "Chemistry": {}, "Communication Studies": {}, "Criminal Justice and Criminology": {}, "English": {}, "Geography and Earth Sciences": {}, "Global Studies": {}, "History": {}, "Languages and Culture Studies": {}, "Mathematics and Statistics": {}, "Philosophy": {}, "Physics and Optical Science": {}, "Political Science and Public Administration": {}, "Psychological Science": {}, "Religious Studies": {}, "Sociology": {}, "Writing, Rhetoric, and Digital Studies": {}}, "Lee College of Engineering": {"Civil and Environmental Engr": {}, "Electrical & Computer Engineering": {}, "Engineering Tech & Constr Mgmt": {}, "EPIC": {}, "Mech Engineering & Engineering Sci": {}, "Student Dev & Success": {}, "Systems Engin & Engin Management": {}}}]